---
type: TessellatedFace
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# TessellatedFace

`Autodesk.Revit.DB.TessellatedFace` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TessellatedFace | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBoundaryLoops | 2015 | `public IList < IList < XYZ >> GetBoundaryLoops ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MaterialId | 2015 | `public ElementId MaterialId { get ; set ; }` |